src/test/testtool/ZoekMetPostcodeEnHuisnummer/03/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:a="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<StUF:organisatie xmlns:stuf="http://www.egem.nl/StUF/StUF0301" xmlns:xsd="http://www.w3.org/2001/XMLSchema">test</StUF:organisatie>
			<StUF:applicatie xmlns:stuf="http://www.egem.nl/StUF/StUF0301" xmlns:xsd="http://www.w3.org/2001/XMLSchema">test123</StUF:applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<StUF:organisatie xmlns:stuf="http://www.egem.nl/StUF/StUF0301" xmlns:xsd="http://www.w3.org/2001/XMLSchema"/>
			<StUF:applicatie xmlns:stuf="http://www.egem.nl/StUF/StUF0301" xmlns:xsd="http://www.w3.org/2001/XMLSchema">GWS</StUF:applicatie>
			<StUF:gebruiker xmlns:stuf="http://www.egem.nl/StUF/StUF0301" xmlns:xsd="http://www.w3.org/2001/XMLSchema">TEST</StUF:gebruiker>
		</StUF:ontvanger>
		<StUF:crossRefnummer>6bdd32e3-91bb-44ac-befb-cccc3ec661fe</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:aantalVoorkomens>3</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="ac47aaecf19c4a1c779f4c64c05c84a7c0c17d54">
			<BG:inp.bsn>999994335</BG:inp.bsn>
			<BG:inp.a-nummer StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaam>Holthuizen</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorletters>P.F.</BG:voorletters>
			<BG:voornamen>Pepijn Floris</BG:voornamen>
			<BG:aanduidingNaamgebruik StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorvoegselGeslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
			<BG:geboortedatum>19800526</BG:geboortedatum>
			<BG:inp.geboorteplaats StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.geboorteLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:wpl.woonplaatsNaam>'S-GRAVENHAGE</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen>
					<BG:wpl.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:wpl.woonplaatsNaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				</BG:aoa.woonplaatsWaarinGelegen>
				<BG:gor.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:opr.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:gor.openbareRuimteNaam>Jonkheer van Riemsdijkln</BG:gor.openbareRuimteNaam>
				<BG:gor.straatnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:aoa.postcode>2497 BV</BG:aoa.postcode>
				<BG:aoa.huisnummer>88</BG:aoa.huisnummer>
				<BG:aoa.huisletter>Riemsdijkln 88</BG:aoa.huisletter>
				<BG:aoa.huisnummertoevoeging StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:begindatumVerblijf StUF:noValue="geenWaarde" xsi:nil="true"/>
			</BG:verblijfsadres>
			<BG:sub.correspondentieAdres/>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.gemeenteVanInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:vbt.aanduidingVerblijfstitel StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVertrekUitNederland StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.emigratieLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:ing.indicatieGezagMinderjarige StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
		</BG:object>
		<BG:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="ac47aaecf19c4a1c779f4c64c05c84a7c0c17d54">
			<BG:inp.bsn>999994736</BG:inp.bsn>
			<BG:inp.a-nummer StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaam>Burck</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam>du</BG:voorvoegselGeslachtsnaam>
			<BG:voorletters>K.M.</BG:voorletters>
			<BG:voornamen>Karin Monique</BG:voornamen>
			<BG:aanduidingNaamgebruik StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorvoegselGeslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
			<BG:geboortedatum>19511223</BG:geboortedatum>
			<BG:inp.geboorteplaats StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.geboorteLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:wpl.woonplaatsNaam>'S-GRAVENHAGE</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen>
					<BG:wpl.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:wpl.woonplaatsNaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				</BG:aoa.woonplaatsWaarinGelegen>
				<BG:gor.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:opr.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:gor.openbareRuimteNaam>Jonkheer van Riemsdijkln</BG:gor.openbareRuimteNaam>
				<BG:gor.straatnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:aoa.postcode>2497 BV</BG:aoa.postcode>
				<BG:aoa.huisnummer>88</BG:aoa.huisnummer>
				<BG:aoa.huisletter>Riemsdijkln 88</BG:aoa.huisletter>
				<BG:aoa.huisnummertoevoeging StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:begindatumVerblijf StUF:noValue="geenWaarde" xsi:nil="true"/>
			</BG:verblijfsadres>
			<BG:sub.correspondentieAdres/>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.gemeenteVanInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:vbt.aanduidingVerblijfstitel StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVertrekUitNederland StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.emigratieLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:ing.indicatieGezagMinderjarige StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
		</BG:object>
		<BG:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="ac47aaecf19c4a1c779f4c64c05c84a7c0c17d54">
			<BG:inp.bsn>999994293</BG:inp.bsn>
			<BG:inp.a-nummer StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaam>Holthuizen</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorletters>D.</BG:voorletters>
			<BG:voornamen>Dirk</BG:voornamen>
			<BG:aanduidingNaamgebruik StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorvoegselGeslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
			<BG:geboortedatum>19460121</BG:geboortedatum>
			<BG:inp.geboorteplaats StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.geboorteLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:wpl.woonplaatsNaam>'S-GRAVENHAGE</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen>
					<BG:wpl.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
					<BG:wpl.woonplaatsNaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				</BG:aoa.woonplaatsWaarinGelegen>
				<BG:gor.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:opr.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:gor.openbareRuimteNaam>Jonkheer van Riemsdijkln</BG:gor.openbareRuimteNaam>
				<BG:gor.straatnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:aoa.postcode>2497 BV</BG:aoa.postcode>
				<BG:aoa.huisnummer>88</BG:aoa.huisnummer>
				<BG:aoa.huisletter>Riemsdijkln 88</BG:aoa.huisletter>
				<BG:aoa.huisnummertoevoeging StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:begindatumVerblijf StUF:noValue="geenWaarde" xsi:nil="true"/>
			</BG:verblijfsadres>
			<BG:sub.correspondentieAdres/>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.gemeenteVanInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:vbt.aanduidingVerblijfstitel StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVertrekUitNederland StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.emigratieLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:ing.indicatieGezagMinderjarige StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>